const String homePageData = '''***Уважаемые коллеги! Рада приветствовать вас на мастер-классе.
Надеюсь, наше сотрудничество будет плодотворным и полезным для нас и для нашей работы!
Думаю, что любое разнообразие образовательного процесса делает обучение увлекательным и эффективным!***

Немного о себе:
Меня зовут Елена Ивановна Куликова. Я учитель английского языка МБОУ СОШ № 1 города Александрова Владимирской области. Уже более 25 лет наша школа является партнером международной организации AFS Интеркультура. Это волонтерская организация, которая занимается межкультурной деятельностью и осуществляет международные детские и волонтерские обмены. Я - волонтер Фонда Интеркультура уже 11 лет и поэтому тема волонтерства мне очень близка и интересна.
Кроме того, я всегда любила разгадывать кроссворды. Так почему бы не объединить два любимых занятия?''';

const String rulesPageData = '''# Положение о Мастер-Классе

### Проект является обучающим мастер-классом с оцениванием созданных мультимедийных продуктов, ведущая курса – Куликова Елена Ивановна.
### Возникающие вопросы по организации мастер-класса следует направлять на электронный почтовый ящик: ei_kulikova@mail.ru с пометкой "Мастер-класс".

---

### I. ЦЕЛИ И ЗАДАЧИ МАСТЕР-КЛАССА

  1.1. Развивать творческий потенциал учителей;

  1.2. Содействовать повышению профессиональной ИКТ-компетенции учителей;

  1.3. Способствовать внедрению в процесс обучения информационно-коммуникационных технологий;

  1.4. Способствовать обмену опытом учителей для повышения качества обучения.

---

### II. УЧАСТНИКИ И СОДЕРЖАНИЕ МАСТЕР-КЛАССА

  2.1. В мастер-классе могут принять участие учителя и преподаватели образовательных учреждений, зарегистрировавшиеся для работы в виртуальном летнем лагере для педагогов 2018 .
  
  2.2. В течение мастер-класса необходимо принять участие во всех обучающих этапах курса, создавая материалы в соответствии с предъявляемыми к ним требованиями;
  
  2.3 Участники мастер-класса работают на площадке форума и обязаны:

    -  Заполнить регистрационную форму, содержащую информацию о себе: Ф.И.О., должность, место работы, город;

    - Заполнить входную анкету;

    - Принимать активное участие в работе мастер-класса, выполняя задания ведущего;

    - По прохождении мастер-класса выложить ссылки на итоговые работы, используя для этого специально созданный общедоступный документ Google;

    - Представленные разработки учителей не должны нарушать законы об авторском праве. Работа, которая нарушает авторское право, не будет считаться зачтенной;

    - Размещая материалы, участники конкурса соглашаются предоставить к ним доступ неограниченного круга лиц.

  2.4. Компоненты работы:

    - В течение курса под руководством ведущего участники курса создают кроссворды в разных программах;

    - Сведения о выполненной работе участники МК самостоятельно заносят в таблицу продвижения;

    - Руководитель МК оценивает работы участников. 4. Рефлексия после каждого этапа (обсуждение сервиса, выбор понравившейся работы коллеги);

    - Итоговой рефлексией являются ответы на вопросы анкеты. 6. Ссылки на созданные работы участники САМОСТОЯТЕЛЬНО заносят в "Таблицу продвижения".

---

### III. ТЕХНИЧЕСКИЕ ТРЕБОВАНИЯ К РАБОТАМ УЧАСТНИКОВ

  3.1. Работа не считается зачтенной в случае, если она не соответствует техническим требованиям, предъявляемым к итоговым работам участников;

  3.2. Ведущий курса публикует обучающий материал и задание для выполнения с подробными указаниями в блоге курса.

---

### IV. СРОКИ ПРОВЕДЕНИЯ МАСТЕР-КЛАССА

  4.1. Мастер-класс проходит с 14 по 28 июля 2018 года.

---

### V. ПОДВЕДЕНИЕ ИТОГОВ МАСТЕР-КЛАССА

  5.1. Все участники мастер-класса получают сертификат участника в электронном виде при условии прохождения всех этапов мастер-класса и участия в рефлексии в блоге мастер-класса''';

const String preStageData = '''# Подготовительный этап
Уважаемые коллеги!
Прошу вас заполнить входную анкету и ознакомиться с критериями оценивания ваших работ.''';

const String preStageData2 = '''### Критерии оценивания:

  1 Соответствие теме задания 1

  2 Количество слов (15 - 20) 1

  3 Аккуратность оформления 1

  4 Задания (все определения, формулировки должны быть однотипны) 1

  5 Орфографическая правильность 1
''';

const String stage1Data = '''# Этап 1
### На этом этапе я предлагаю вам познакомиться с сервисом "Фабрика кроссвордов".

Изучите инструкцию по созданию кроссвордов 
''';

const String stage1Data2 = '''Создайте свой кроссворд на тему "Волонтерство".

### Ссылку на кроссворд опубликуйте в Таблице продвижения.

В комментариях под этим постом ответьте на следующие вопросы:
  
  1. Понравилась ли вам работа в этом сервисе?
  
  2. Возникали у вас какие либо сложности? Если возникали, то как вы их решали?

### Посмотрите кроссворды коллег и выберите тот, который вам понравился больше всего.
Фамилию автора полюбившегося кроссворда укажите в комментариях под этим постом. 
''';

const String stage2Data = '''# Этап 2
### На этом этапе предлагаю вам познакомиться с сервисом "Кроссвордус"

Посмотрите обучающее видео
''';

const String stage2Data2 = '''Создайте свой кроссворд по теме "Лето", ссылку на него опубликуйте в Таблице продвижения.

### В комментариях под этим постом ответьте на следующие вопросы:
  
  1. Понравилась ли вам работа в этом сервисе?
  
  2. Возникали у вас какие либо сложности? Если возникали, то как вы их решали?

### Посмотрите кроссворды коллег и выберите тот, который вам понравился больше всего.
Фамилию автора полюбившегося кроссворда укажите в комментариях под этим постом. 
''';

const String stage3Data = '''# Этап 3

### На этом этапе предлагаю вам познакомиться с сервисом Биоуроки

Посмотрите обучающее видео
''';

const String stage3Data2 = '''Создайте свой кроссворд по теме "Школа", ссылку на него опубликуйте в Таблице продвижения.

### В комментариях под этим постом ответьте на следующие вопросы:
  1. Понравилась ли вам работа в этом сервисе?

  2. Возникали у вас какие либо сложности? Если возникали, то как вы их решали?

### Посмотрите кроссворды коллег и выберите тот, который вам понравился больше всего.
Фамилию автора полюбившегося кроссворда укажите в комментариях под этим постом.  
''';

const String reflectPage = '''Рефлексия''';
